{
    "books": [
        {
            "title": "The Great Gatsby",
            "author": "F. Scott Fitzgerald",
            "description": "The Great Gatsby is a 1925 novel by American writer F. Scott Fitzgerald. Set in the Jazz Age on Long Island, the novel depicts narrator Nick Carraway's interactions with mysterious millionaire Jay Gatsby and Gatsby's obsession to reunite with his former lover, Daisy Buchanan.",
            "publishedDate": "April 10, 1925",
            "pageCount": "218",
            "coverUrl": "https://images-na.ssl-images-amazon.com/images/I/71FTb9X6wsL.jpg",
            "readLink": "https://www.gutenberg.org/ebooks/64317"
        },
        {
            "title": "To Kill a Mockingbird",
            "author": "Harper Lee",
            "description": "To Kill a Mockingbird is a novel by Harper Lee published in 1960. Instantly successful, widely read in high schools and middle schools in the United States, it has become a classic of modern American literature, winning the Pulitzer Prize.",
            "publishedDate": "July 11, 1960",
            "pageCount": "281",
            "coverUrl": "https://upload.wikimedia.org/wikipedia/commons/4/4f/To_Kill_a_Mockingbird_%28first_edition_cover%29.jpg",
            "readLink": "https://archive.org/details/to-kill-a-mockingbird-harper-lee"
        },
        {
            "title": "1984",
            "author": "George Orwell",
            "description": "Nineteen Eighty-Four is a dystopian social science fiction novel by English novelist George Orwell. It was published on 8 June 1949 by Secker & Warburg as Orwell's ninth and final book completed in his lifetime.",
            "publishedDate": "June 8, 1949",
            "pageCount": "328",
            "coverUrl": "https://images-na.ssl-images-amazon.com/images/I/71kxa1-0mfL.jpg",
            "readLink": "https://www.gutenberg.org/ebooks/60670"
        },
        {
            "title": "Pride and Prejudice",
            "author": "Jane Austen",
            "description": "Pride and Prejudice is an 1813 romantic novel of manners written by Jane Austen. The novel follows the character development of Elizabeth Bennet, the dynamic protagonist of the book who learns about the repercussions of hasty judgments and comes to appreciate the difference between superficial goodness and actual goodness.",
            "publishedDate": "January 28, 1813",
            "pageCount": "279",
            "coverUrl": "https://images-na.ssl-images-amazon.com/images/I/71Q1tPupKjL.jpg",
            "readLink": "https://www.gutenberg.org/ebooks/1342"
        },
        {
            "title": "The Hobbit",
            "author": "J.R.R. Tolkien",
            "description": "The Hobbit, or There and Back Again is a children's fantasy novel by English author J. R. R. Tolkien. It was published in 1937 to wide critical acclaim, being nominated for the Carnegie Medal and awarded a prize from the New York Herald Tribune for best juvenile fiction.",
            "publishedDate": "September 21, 1937",
            "pageCount": "310",
            "coverUrl": "https://images-na.ssl-images-amazon.com/images/I/710+HcoP38L.jpg",
            "readLink": "https://archive.org/details/TheHobbitByJ.R.R.Tolkien"
        },
        {
            "title": "Moby-Dick",
            "author": "Herman Melville",
            "description": "Moby-Dick; or, The Whale is an 1851 novel by American writer Herman Melville. The book is the sailor Ishmael's narrative of the obsessive quest of Ahab, captain of the whaling ship Pequod, for revenge on Moby Dick, the giant white sperm whale that on the ship's previous voyage bit off Ahab's leg at the knee.",
            "publishedDate": "October 18, 1851",
            "pageCount": "635",
            "coverUrl": "https://images-na.ssl-images-amazon.com/images/I/91dSMhdIzTL.jpg",
            "readLink": "https://www.gutenberg.org/ebooks/2701"
        },
        {
            "title": "War and Peace",
            "author": "Leo Tolstoy",
            "description": "War and Peace is a literary work mixed with chapters on history and philosophy by the Russian author Leo Tolstoy. It was first published serially, then published in its entirety in 1869. It is regarded as one of Tolstoy's finest literary achievements and remains a classic of world literature.",
            "publishedDate": "1869",
            "pageCount": "1225",
            "coverUrl": "https://images-na.ssl-images-amazon.com/images/I/91DfSdQqAQL.jpg",
            "readLink": "https://www.gutenberg.org/ebooks/2600"
        },
        {
            "title": "The Catcher in the Rye",
            "author": "J.D. Salinger",
            "description": "The Catcher in the Rye is a novel by J. D. Salinger, partially published in serial form in 1945-1946 and as a novel in 1951. It was originally intended for adults but is often read by adolescents for its themes of angst, alienation, and as a critique on superficiality in society.",
            "publishedDate": "July 16, 1951",
            "pageCount": "234",
            "coverUrl": "https://images-na.ssl-images-amazon.com/images/I/91HPG31dTwL.jpg",
            "readLink": "https://archive.org/details/TheCatcherInTheRye_201810"
        },
        {
            "title": "The Lord of the Rings",
            "author": "J.R.R. Tolkien",
            "description": "The Lord of the Rings is an epic high-fantasy novel by English author and scholar J. R. R. Tolkien. Set in Middle-earth, intended to be Earth at some distant time in the past, the story began as a sequel to Tolkien's 1937 children's book The Hobbit, but eventually developed into a much larger work.",
            "publishedDate": "July 29, 1954",
            "pageCount": "1178",
            "coverUrl": "https://images-na.ssl-images-amazon.com/images/I/51EstVXM1UL.jpg",
            "readLink": "https://archive.org/details/TheLordOfTheRingsAll3Books"
        },
        {
            "title": "Crime and Punishment",
            "author": "Fyodor Dostoevsky",
            "description": "Crime and Punishment is a novel by the Russian author Fyodor Dostoevsky. It was first published in the literary journal The Russian Messenger in twelve monthly installments during 1866. It was later published in a single volume. It is the second of Dostoevsky's full-length novels following his return from ten years of exile in Siberia.",
            "publishedDate": "1866",
            "pageCount": "430",
            "coverUrl": "https://images-na.ssl-images-amazon.com/images/I/71jD43a6K1L.jpg",
            "readLink": "https://www.gutenberg.org/ebooks/2554"
        },
        {
            "title": "The Odyssey",
            "author": "Homer",
            "description": "The Odyssey is one of two major ancient Greek epic poems attributed to Homer. It is one of the oldest extant works of literature still read by contemporary audiences. As with the Iliad, the poem is divided into 24 books. It follows the Greek hero Odysseus, king of Ithaca, and his journey home after the Trojan War.",
            "publishedDate": "8th century BC",
            "pageCount": "541",
            "coverUrl": "https://images-na.ssl-images-amazon.com/images/I/71kQ1+4XB+L.jpg",
            "readLink": "https://www.gutenberg.org/ebooks/1727"
        },
        {
            "title": "Frankenstein",
            "author": "Mary Shelley",
            "description": "Frankenstein; or, The Modern Prometheus is a novel written by English author Mary Shelley that tells the story of Victor Frankenstein, a young scientist who creates a hideous, sapient creature in an unorthodox scientific experiment.",
            "publishedDate": "January 1, 1818",
            "pageCount": "280",
            "coverUrl": "https://images-na.ssl-images-amazon.com/images/I/71qOK6x3HBL.jpg",
            "readLink": "https://www.gutenberg.org/ebooks/84"
        },
        {
            "title": "Brave New World",
            "author": "Aldous Huxley",
            "description": "Brave New World is a dystopian novel by English author Aldous Huxley, written in 1931 and published in 1932. Largely set in a futuristic World State, whose citizens are environmentally engineered into an intelligence-based social hierarchy, the novel anticipates huge scientific advancements in reproductive technology, sleep-learning, psychological manipulation and classical conditioning that are combined to make a dystopian society which is challenged by only a single individual: the story's protagonist.",
            "publishedDate": "1932",
            "pageCount": "288",
            "coverUrl": "https://images-na.ssl-images-amazon.com/images/I/81zE42gT3xL.jpg",
            "readLink": "https://archive.org/details/BraveNewWorld_201810"
        },
        {
            "title": "The Brothers Karamazov",
            "author": "Fyodor Dostoevsky",
            "description": "The Brothers Karamazov is the final novel by the Russian author Fyodor Dostoevsky. Dostoevsky spent nearly two years writing The Brothers Karamazov, which was published as a serial in The Russian Messenger from January 1879 to November 1880. The author died less than four months after its publication.",
            "publishedDate": "November 1880",
            "pageCount": "796",
            "coverUrl": "https://images-na.ssl-images-amazon.com/images/I/81lQwZfc+VL.jpg",
            "readLink": "https://www.gutenberg.org/ebooks/28054"
        },
        {
            "title": "Jane Eyre",
            "author": "Charlotte Brontë",
            "description": "Jane Eyre is a novel by English writer Charlotte Brontë, published under the pen name \"Currer Bell\", on 16 October 1847, by Smith, Elder & Co. of London. The first American edition was published the following year by Harper & Brothers of New York. Jane Eyre is a Bildungsroman which follows the experiences of its eponymous heroine, including her growth to adulthood and her love for Mr. Rochester, the brooding master of Thornfield Hall.",
            "publishedDate": "October 16, 1847",
            "pageCount": "500",
            "coverUrl": "https://images-na.ssl-images-amazon.com/images/I/71kYaW-1qJL.jpg",
            "readLink": "https://www.gutenberg.org/ebooks/1260"
        },
        {
            "title": "Wuthering Heights",
            "author": "Emily Brontë",
            "description": "Wuthering Heights is an 1847 novel by Emily Brontë, initially published under her pen name Ellis Bell. It concerns two families of the landed gentry living on the West Yorkshire moors, the Earnshaws and the Lintons, and their turbulent relationships with Earnshaw's adopted son, Heathcliff. The novel was influenced by Romanticism and Gothic fiction.",
            "publishedDate": "December 1847",
            "pageCount": "342",
            "coverUrl": "https://images-na.ssl-images-amazon.com/images/I/71kYaW-1qJL.jpg",
            "readLink": "https://www.gutenberg.org/ebooks/768"
        },
        {
            "title": "The Divine Comedy",
            "author": "Dante Alighieri",
            "description": "The Divine Comedy is an Italian narrative poem by Dante Alighieri, begun c. 1308 and completed in 1320, a year before his death in 1321. It is widely considered to be the pre-eminent work in Italian literature and one of the greatest works of world literature.",
            "publishedDate": "1320",
            "pageCount": "798",
            "coverUrl": "https://images-na.ssl-images-amazon.com/images/I/71kYaW-1qJL.jpg",
            "readLink": "https://www.gutenberg.org/ebooks/8800"
        },
        {
            "title": "Don Quixote",
            "author": "Miguel de Cervantes",
            "description": "Don Quixote is a Spanish novel by Miguel de Cervantes. It was originally published in two parts, in 1605 and 1615. A founding work of Western literature, it is often labeled as the first modern novel and one of the greatest works ever written. Don Quixote is also one of the most-translated books in the world.",
            "publishedDate": "1605 (Part 1), 1615 (Part 2)",
            "pageCount": "863",
            "coverUrl": "https://images-na.ssl-images-amazon.com/images/I/71kYaW-1qJL.jpg",
            "readLink": "https://www.gutenberg.org/ebooks/996"
        },
        {
            "title": "Anna Karenina",
            "author": "Leo Tolstoy",
            "description": "Anna Karenina is a novel by the Russian author Leo Tolstoy, first published in book form in 1878. Widely considered to be one of the greatest works of literature ever written, Tolstoy himself called it his first true novel. It was initially released in serial installments from 1873 to 1877 in the periodical The Russian Messenger.",
            "publishedDate": "1878",
            "pageCount": "864",
            "coverUrl": "https://images-na.ssl-images-amazon.com/images/I/71kYaW-1qJL.jpg",
            "readLink": "https://www.gutenberg.org/ebooks/1399"
        },
        {
            "title": "The Adventures of Huckleberry Finn",
            "author": "Mark Twain",
            "description": "Adventures of Huckleberry Finn is a novel by Mark Twain, first published in the United Kingdom in December 1884 and in the United States in February 1885. Commonly named among the Great American Novels, the work is among the first in major American literature to be written throughout in vernacular English, characterized by local color regionalism.",
            "publishedDate": "December 10, 1884",
            "pageCount": "366",
            "coverUrl": "https://images-na.ssl-images-amazon.com/images/I/71kYaW-1qJL.jpg",
            "readLink": "https://www.gutenberg.org/ebooks/76"
        }
    ]
}